Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: སྲིན་པོ་སྣ་ཚོགས་ལས་གྱུར་པའི། །གཟའ་དང་རྒྱུ་སྐར་འབྱུང་བར་འགྱུར། །
en: There will planets and lunar asterisms That arise from various rākṣasas.

source: ཆོས་མིན་ཕྱོགས་ལ་རབ་གནས་ཏེ། །རྒྱལ་པོ་ཆོས་དང་མི་ལྡན་པས། །འཇིག་རྟེན་གསུམ་གྱི་དཀྱིལ་འཁོར་ན། །ཁམས་གསུམ་རྣམ་པར་འཇིག་པར་འགྱུར། །
en: “ ‘ “The king who is not righteous, Who is on the side of unrighteousness, Will in the circle of the three worlds Be destructive for the three realms.

source: གང་ཚེ་རྒྱལ་པོ་ཕྱོགས་གནས་ཏེ། །ཉེས་བྱེད་ཡལ་བར་འདོར་བའི་ཚེ། །འདི་འདྲའི་ཉེས་པ་དུ་མ་དག །ཡུལ་རྣམས་སུ་ནི་འབྱུང་བར་འགྱུར། །
en: “ ‘ “When those on the side of the king Who perform evil acts are left alone, Then many of such evil actions Will arise within those lands.

source: ལྷ་དབང་རྣམས་ཀྱིས་དགོས་གང་ཕྱིར། །རྒྱལ་པོའི་བྱིན་གྱིས་བརླབས་པ་ཡི། །རྒྱལ་པོ་ཉིད་ནི་མི་བྱེད་ཅིང་། །ཉེས་བྱེད་ཡལ་བར་འདོར་ན་ནི། །
en: “ ‘ “If the king ignores evil actions, He does not fulfill the purpose For which the lords of devas Blessed him to become a king.

source: ལེགས་པར་བྱས་པས་སེམས་ཅན་རྣམས། །ལྷ་ཡི་གནས་སུ་ལྷར་ཡང་སྐྱེ། །
en: “ ‘ “Through having done good actions, Beings are reborn in the paradises.

source: ཉེས་པར་བྱས་པས་ཡི་དགས་དང་། །སེམས་ཅན་དམྱལ་དང་དུད་འགྲོར་སྐྱེ། །
en: Through doing bad actions, they are Reborn as pretas, in hells, and as animals.

source: གང་ཚེ་རྒྱལ་པོ་ཡུལ་རྣམས་ན། །ཉེས་བྱེད་ཡལ་བར་འདོར་བའི་ཚེ། །སུམ་ཅུ་གསུམ་གྱི་ལྷ་གནས་ནས། །
en: “ ‘ “Whenever a king does nothing about The wicked inhabitants in his realm, Then through those evil acts being done, Beings will fall from the Trāyastriṃśa paradise.

source: ཉེས་པ་བྱས་པས་ལྟུང་བར་འགྱུར། །རྒྱལ་པོ་ཉིད་ནི་མི་བྱེད་ན། །དེ་ཡི་བུ་ཡང་མ་ཡིན་ལ། །ལྷ་ཡི་རྒྱལ་པོ་ཕ་རྣམས་ཀྱི། །གནས་ལ་ཉེས་དང་བཅས་པར་འགྱུར། །
en: “ ‘ “If he is not acting as a king, Then he will also not be a son, And in the realm of his fathers, the deva kings, He will have become guilty of a crime.

source: གཡོ་ནི་ཤིན་ཏུ་མི་བཟད་པས། །གང་ཚེ་ཡུལ་འཁོར་འཇིག་འགྱུར་བ། །དེ་ཕྱིར་ལྷ་ཡི་དབང་རྣམས་ཀྱིས། །མིའི་གནས་རྒྱལ་པོ་བྱིན་གྱིས་བརླབས། །ཉེས་པར་བྱས་པ་ཞི་བྱའི་ཕྱིར། །
en: “ ‘ “When a kingdom is being destroyed By extremely terrible dishonesty, It is for that reason that the lords of devas Blessed him to become a king in the human realm.

source: ལེགས་པར་བྱེད་ལ་འཛུད་པ་སྟེ། །ཚེ་འདི་ལ་ནི་སེམས་ཅན་ལ། །ཡུལ་གྱི་ཆོས་ཀྱི་དོན་གྱི་ཕྱིར། །རྣམ་སྨིན་སྐྱེད་པ་རྒྱལ་པོ་ཡིན། །
en: “ ‘ “A king is someone who manifests For beings the results of karma in that life.

source: ལེགས་བྱས་དང་ནི་ཉེས་བྱས་ཀྱི། །
en: He is someone who initiates good actions In order to cause evil acts to cease, And for the sake of Dharma in the land.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་འབྲས། །རྣམ་པ་ཐ་དད་བསྟན་པའི་ཕྱིར། །བྱེད་པ་གང་ཡིན་རྒྱལ་པོར་བརྗོད། །
en: “ ‘ “Someone is called a king because their actions Are in order to teach the difference between The results that ripen from the karma Of having done good or having done bad.

source: བདག་གི་དོན་དང་གཞན་དོན་དང་། །ཡུལ་གྱི་ཆོས་ཀྱི་དོན་གྱི་ཕྱིར། །ལྷ་ཚོགས་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས། །ལྷ་རྣམས་དག་ཀྱང་རྗེས་ཡི་རང་། །
en: “ ‘ “He was blessed by the multitudes of devas For the benefit of himself and the benefit of others, And for the benefit of the Dharma in that land, And all those devas are gladdened by him.

source: ཡུལ་འཁོར་རྣམས་ན་སྐྱེ་བོ་ནི། །སྡིག་ཅན་གཡོན་ཅན་འདུལ་བ་དང་། །ཡུལ་གྱི་ཆོས་ཀྱི་དོན་གྱི་ཕྱིར། །སྲོག་དང་རྒྱལ་སྲིད་རྣམས་ཀྱང་བཏང་། །
en: “ ‘ “To subdue the deceitful, evil people Who are inhabitants in his domains, And to benefit the Dharma in his kingdom, He will give away his life and his kingship.

source: ཆོས་མ་ཡིན་པ་བཟོད་བྱེད་ཅིང་། །ཤེས་བཞིན་ཡལ་བར་འདོར་བ་ནི། །ཡུལ་ན་འཇིགས་པ་མི་བཟད་པ། །དེ་འདྲ་གཞན་དུ་ཡོད་མ་ཡིན། །ཇི་ལྟར་གཡོ་རྣམས་བྱུང་བ་ལ། །
en: “ ‘ “To accept unrighteousness And to knowingly pay it no attention Is a dreadful danger for the realm With which nothing else can compare.

source: གཡོ་བྱེད་ཆད་པས་མ་བཅད་ན། །ཡུལ་དུ་ཤིན་ཏུ་མི་བཟད་པའི། །གཡོ་རྣམས་ཕྱིར་ནི་འབྱུང་བར་འགྱུར། །
en: “ ‘ “When there is the appearance of dishonesty, If those who are dishonest are not punished, Then afterward there will be in the land Extremely dreadful dishonest people.

source: གླང་ཆེན་རྣམས་ཀྱིས་རྫིང་ཆེན་བཞིན། །ཡུལ་འཁོར་དེར་ནི་རྣམ་པར་འཇིག །
en: “ ‘ “They will destroy that kingdom Like elephants do a great pond.

source: ལྷ་དབང་རྣམས་ཀྱང་འཁྲུག་པར་འགྱུར། །ལྷ་ཡི་གནས་ནི་རྣམ་པར་འཇིག །
en: The lords of devas will also be disturbed, And it will bring ruin to the paradises.

source: ཡུལ་དུ་དངོས་པོ་ཐམས་ཅད་ནི། །མ་རུངས་པར་ཡང་འགྱུར་བས་ན། །
en: “ ‘ “Everything in the land Will become pernicious.

source: དེ་ཕྱིར་སྡིག་པ་བྱེད་པ་རྣམས། །ཉེས་པའི་རིམ་བཞིན་གདུལ་བར་བྱ། །
en: Therefore, the evil actions of those who Are wicked should be successively subdued.

source: ཆོས་ཀྱིས་ཡུལ་འཁོར་བསྐྱང་བར་བྱ། །ཆོས་མ་ཡིན་པ་སྤྱད་མི་བྱ། །
en: “ ‘ “He should protect the kingdom with righteousness And he should never practice unrighteousness.

source: སྲོག་ཀྱང་ཡོངས་སུ་གཏང་བྱ་ཞིང་། །ཉེས་མགོན་བྱ་བར་མི་བྱའོ། །
en: He should not become a sinful lord, Even if he has to give up his life.

source: སྐྱེ་བོ་གཉེན་དང་སྐྱེ་བོ་གཞན། །ཡུལ་འཁོར་སྐྱེ་བོ་ཐམས་ཅད་ལ། །རྒྱལ་པོས་ཕྱོགས་ཀྱང་གཅིག་བྱ་ཡི། །ཕྱོགས་སུ་ལྷུང་བར་གྱུར་ཏ་རེ། །
en: “ ‘ “Toward his family and other people, Toward all the people in his kingdom, The king should not show favoritism Through which he will fall into bias.

source: རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཡི། །གྲགས་པ་འཇིག་རྟེན་གསུམ་གང་སྟེ། །སུམ་ཅུ་གསུམ་གྱི་གནས་རྣམས་ན། །ལྷ་ཡི་དབང་པོ་དགར་གྱུར་ཏེ། །
en: “ ‘ “The renown of a king who is Righteous will fill the three worlds, And he will bring joy to the lords of devas Who are in the Trāyastriṃśa paradise.

source: འཛམ་བུའི་གླིང་ན་ངེད་ཀྱི་བུ། །འདི་ལྟར་ཆོས་ལྡན་རྒྱལ་པོ་ཡིན། །
en: “ ‘ “They will think, ‘Our son in Jambudvīpa Is in this way a righteous king.

source: ཆོས་ཀྱི་ཡུལ་འཁོར་དེར་བསྟན་ནས། །ལེགས་པར་བྱུང་ལ་སྐྱེ་བོ་བཀོད། །
en: He displays a Dharma kingdom, And establishes beings in good actions.’

source: རྒྱལ་པོ་དེ་ནི་ལེགས་བྱེད་པས། །སྐྱེ་བོ་དག་ནི་འདིར་འགྱེད་དེ། །ལྷ་དང་ལྷ་ཡི་བུ་རྣམས་ཀྱིས། །ལྷ་གནས་གང་བར་བྱེད་སྙམ་མོ། །
en: “ ‘ “The king, through his good actions, Inspires beings in this world to think That the paradises are being filled With devas and the children of devas.

source: ཆོས་ཀྱི་ཡུལ་འཁོར་དེར་བསྟན་ནས། །རྒྱལ་པོ་རྣམས་ནི་རབ་ཏུ་དགའ། །
en: “ ‘ “Displaying there a Dharma kingdom Will cause the kings to rejoice.

source: ལྷ་དབང་རབ་ཏུ་དད་གྱུར་པས། །མི་ཡི་རྒྱལ་པོ་དེ་ལ་སྲུང་། །
en: The lords of devas will favor him, And they will protect that human king.

source: ཉི་ཟླ་དང་ནི་དེ་བཞིན་དུ། །རྒྱུ་སྐར་ལེགས་པར་རྒྱུ་བར་འགྱུར། །
en: “ ‘ “The sun, the moon, and similarly The lunar asterisms will move perfectly.

source: རླུང་ཡང་དུས་སུ་ལྡང་འགྱུར་ཞིང་། །ཆར་པའང་དུས་སུ་འབབ་པར་འགྱུར། །
en: The winds will arise at the proper times, And the rains will also come at the right time.

source: ལྷ་གནས་རྣམས་དང་དེ་བཞིན་དུ། །ཡུལ་འཁོར་རྣམས་སུ་ལོ་ལེགས་བྱེད། །
en: “ ‘ “There will be excellent harvests in the kingdom And likewise in the realms of the devas.

source: ལྷ་དང་ལྷ་ཡི་བུ་རྣམས་ཀྱིས། །ལྷ་ཡི་གནས་རྣམས་གང་བར་བྱེད། །
en: The devas and the children of devas Will fill the abodes of the devas.

source: དེ་ལྟ་བས་ན་རྒྱལ་པོ་ཡིས། །བདག་གི་ཕངས་པའི་སྲོག་བཏང་གིས། །གང་གིས་འཇིག་རྟེན་བདེར་འགྱུར་བ། །དཀོན་མཆོག་ཆོས་ནི་མི་བཏང་སྟེ། །
en: “ ‘ “In that way the monarch will Give up his own dear life In order to make the world happy And not give up the precious Dharma.

source: ཡོན་ཏན་རྣམས་ཀྱིས་གང་བརྒྱན་པ། །ཆོས་དང་ལྡན་པ་བསྟེན་པར་བྱ། །
en: “ ‘ “The one who is adorned by good qualities Relies on being in possession of righteousness.

source: རང་གི་སྐྱེ་བོས་རྟག་དགའ་བ། །རྟག་པར་སྡིག་པ་རྣམ་པར་སྤོངས། །
en: He constantly makes beings happy, And he constantly rejects bad actions.

source: ཆོས་ཀྱིས་ཡུལ་འཁོར་བསྐྱང་བར་བྱ། །ཆོས་ཀྱང་ཡང་དག་བསྟན་པར་བྱ། །
en: “ ‘ “He protects the realm with righteousness, And he correctly teaches righteousness.

source: ལེགས་པར་བྱེད་ལ་སེམས་ཅན་དགོད། །ཉེས་བྱེད་ལས་ནི་བཟློག་པར་བྱ། །
en: He establishes beings in good actions And turns them away from bad actions.

source: གང་ཚེ་སྡིག་པ་བྱེད་པ་རྣམས། །ཚུལ་བཞིན་གདུལ་བར་བྱེད་པའི་ཚེ། །ཡུལ་འཁོར་དུ་ནི་ལོ་ལེགས་ཤིང་། །རྒྱལ་པོ་གཟི་བརྗིད་ལྡན་པར་འགྱུར། །
en: “ ‘ “When he correctly subjugates Those who commit bad actions, There will be good harvests in the kingdom, And the king will have majesty.

source: རྒྱལ་པོ་གྲགས་དང་ལྡན་འགྱུར་ཞིང་། །སྐྱེ་དགུ་རྣམས་ཀྱང་བདེ་བར་སྐྱོང་། །
en: “ ‘ “The king will be renowned And will protect the happiness of beings.” ’ ”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་རྒྱལ་པོའི་བསྟན་བཅོས་ལྷའི་དབང་པོའི་དམ་ཚིག་ཅེས་བྱ་བའི་ལེའུ་སྟེ་ཉི་ཤུ་པའོ།། །།བམ་པོ་དགུ་པ།
en: This concludes “The King’s Treatise: The Commitment of the Lord of Devas,” the twentieth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །གང་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར། །དེ་ཚེ་རྒྱ་མཚོར་བཅས་པའི་ས་རྣམས་དང་། །
en: Chapter 21: Susaṃbhava Then at that time, the Bhagavat recited these verses: “Whenever I was a cakravartin king, I gave away the earth with its oceans.

source: གླིང་བཞི་རིན་ཆེན་གང་བར་བཅས་པ་ཡང་། །སྔོན་གྱི་རྒྱལ་བ་དག་ལ་ངས་ཕུལ་ལོ། །
en: I offered the four continents Filled with jewels to the past jinas.

source: ཆོས་ཀྱི་སྐུ་དེ་ཡོངས་སུ་བཙལ་བའི་ཕྱིར། །གང་སྔོན་ཡིད་དུ་འོང་ཞིང་ཕངས་པ་ཡི། །དངོས་པོ་དེ་དག་ངས་ནི་མ་བཏང་མེད། །བསྐལ་པ་དུ་མར་ཕངས་པའི་སྲོག་ཀྱང་བཏང་། །ཇི་ལྟར་སྔོན་གྱི་བསྐལ་པ་བསམ་ཡས་ན། །
en: “Because I sought the Dharma body, There was nothing in the past that was pleasant And cherished that I did not give away, And in many eons, I even gave up my cherished life.

source: རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་བདེ་བར་གཤེགས། །མྱ་ངན་འདས་པའི་བདེ་བར་གཤེགས་དེ་ཡི། །བསྟན་ལ་ལེགས་བྱུང་ཞེས་བྱའི་རྒྱལ་པོ་བྱུང་། །
en: “Many countless eons ago, I was King Susaṃbhava Within the teaching of the sugata Ratnaśikhin, A sugata who had passed into nirvāṇa.

source: དེ་ནི་གླིང་བཞིའི་དབང་ཕྱུག་འཁོར་ལོས་སྒྱུར། །རྒྱ་མཚོར་ཐུག་པའི་ས་ལ་རབ་ཏུ་སྟོན། །
en: “He was a cakravartin who ruled the four continents, And he reigned over the land as far as the oceans.

source: རྒྱལ་དབང་གསུང་ཕྱིར་རྒྱལ་པོའི་ཕོ་བྲང་ན། །དེ་ཚེ་རྒྱལ་པོ་དམ་པ་གཉིད་ཀྱིས་ལོག །
en: At that time, the excellent king went to sleep In the royal palace for the teaching of the lord of jinas.

source: རྨི་ལམ་དུ་ནི་སངས་རྒྱས་ཡོན་ཏན་ཐོས། །ཆོས་སྨྲ་རིན་ཆེན་སོགས་ཀྱི་རྨི་ལམ་ན། །རྣམ་པར་ལྷང་ངེར་མདོ་སྡེའི་རྒྱལ་པོ་འདི། །རབ་ཏུ་འཆད་ཅིང་འདུག་པ་མཐོང་བར་གྱུར། །
en: “In a dream he heard the qualities of a buddha, And in a dream about the dharmabhāṇaka Ratnoccaya, he clearly saw him Teaching this lord of the sūtras.

source: རྒྱལ་པོ་དེ་ནི་གཉིད་ཀྱིས་ལོག་ལས་སད། །དེ་ཡི་ལུས་ཀུན་དགའ་བས་ཁྱབ་པར་གྱུར། །
en: “That king awoke from his sleep, His entire body filled with joy.

source: མགུ་ནས་རྒྱལ་པོའི་ཁབ་ནས་མངོན་བྱུང་སྟེ། །ཉན་ཐོས་དགེ་འདུན་མཆོག་གི་གནས་སུ་སོང་། །
en: He reverently left the royal capital And approached the excellent śrāvaka saṅgha.

source: རྒྱལ་བའི་ཉན་ཐོས་རྣམས་ལ་མཆོད་བྱེད་ཅིང་། །འཕགས་པའི་དགེ་འདུན་འདི་ནི་རིན་ཆེན་སོགས། །ཡོན་ཏན་ལྡན་པའི་དགེ་སློང་གང་ཡོད་ཅེས། །ཆོས་སྨྲ་རིན་ཆེན་སོགས་པ་ཀུན་ཏུ་དྲིས། །
en: “He made offerings to the Jina’s śrāvakas, And he questioned this ārya saṅgha About the dharmabhāṇaka Ratnoccaya: ‘Where is Ratnoccaya, the bhikṣu with qualities?’

source: དེ་ཡི་ཚེ་ན་རིན་ཆེན་སོགས་པ་ནི། །ཕུག་གཞན་ཞིག་གི་ནང་ན་འདུག་གྱུར་ཏེ། །མདོ་སྡེའི་རྒྱལ་པོ་འདི་ནི་རྣམ་སེམས་ལ། །ཁ་ཏོན་བྱེད་ཅིང་བདེ་བར་རབ་ཏུ་འདུག །
en: “At that time, Ratnoccaya Was dwelling in another cave In a state of happiness, contemplating And reciting this king of sūtras.

source: དགེ་སློང་ཆོས་སྨྲ་རིན་ཆེན་སོགས་པ་དེ། །ཕུན་སུམ་གཟི་བརྗིད་དཔལ་གྱིས་རབ་འབར་ཞིང་། །ཕུག་གཞན་ཞིག་ན་འདུག་པར་གྱུར་པ་དེས། །དེ་ཡི་ཚེ་ན་རྒྱལ་པོ་དེ་ལ་བསྟན། །
en: “Just then they showed the king The dharmabhāṇaka Ratnoccaya, Shining with perfect, glorious magnificence And residing in another cave.

source: འདི་ན་ཆོས་སྨྲ་རིན་ཆེན་སོགས་པ་འདི། །རྒྱལ་པོའི་སྤྱོད་ཡུལ་ཟབ་མོ་འཛིན་པ་སྟེ། །གསེར་འོད་དམ་པ་ཞེས་ནི་བྱ་བ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་རྟག་ཏུ་སྟོན། །
en: “There the dharmabhāṇaka Ratnoccaya, Who possessed the profound range of the jinas, Was constantly teaching the lord king of sūtras That is called The Sublime Golden Light.

source: རིན་ཆེན་སོགས་པའི་རྐང་ལ་ཕྱག་འཚལ་ཏེ། །རྒྱལ་པོ་ལེགས་པར་བྱུང་བས་འདི་སྐད་སྨྲས། །གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ། །ཟླ་བ་ཉ་བའི་ཞལ་འདྲ་བཤད་དུ་གསོལ། །
en: “King Susaṃbhava bowed down To the feet of Ratnoccaya and said, ‘I pray to you, who has a face like the full moon, to teach The Lord King of Sūtras, the Sublime Golden Light.’

source: རྒྱལ་པོ་ལེགས་པར་བྱུང་བ་དེ་ཉིད་ལ། །རིན་ཆེན་སོགས་པས་ཁས་ནི་བླངས་པས་ན། །སྟོང་གསུམ་པ་ཡི་འཇིག་རྟེན་ཐམས་ཅད་དུ། །ལྷ་རྣམས་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་གྱུར། །
en: “When Ratnoccaya promised that king, Susaṃbhava, that he would do so, All the devas throughout all the worlds In the trichiliocosm became overjoyed.

source: དེ་ཚེ་མི་ཡི་དབང་པོས་ས་ཕྱོགས་གཞི། །གཙང་ཞིང་མཆོག་ཏུ་ཁྱད་པར་འཕགས་པ་དེར། །རིན་ཆེན་ཆུ་དང་སྤོས་ཆུས་ཆག་ཆག་བཏབ། །མེ་ཏོག་སིལ་མ་བཀྲམ་སྟེ་ཁྲི་བཤམས་ནས། །
en: “At that time, the lord of men sprinkled Precious water and scented water On the ground of a pure and superior place, Scattered flower petals, and arranged a throne.

source: རྒྱལ་པོས་ཁྲི་དེ་གདུགས་དང་རྒྱལ་མཚན་དང་། །དར་ཡུག་སྟོང་ཕྲག་དུ་མས་ལེགས་པར་བརྒྱན། །
en: “The king adorned that throne with many thousands Of parasols, banners, and rolls of silk.

source: རྒྱལ་པོས་ཁྲི་དེར་ཙནྡན་དམ་པ་དག །རྣམ་པ་སྣ་ཚོགས་རྣམས་ཀྱང་མངོན་པར་གཏོར། །
en: The king scattered upon that throne Various kinds of excellent sandalwood.

source: ལྷ་དང་ཀླུ་དང་ལྷ་མིན་མི་འམ་ཅི། །གནོད་སྦྱིན་དབང་དང་གནོད་སྦྱིན་ལྟོ་འཕྱེ་ཆེས། །ལྷ་ཡི་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར། །ཁྲི་དེ་ལ་ནི་མངོན་པར་རབ་ཏུ་ཕབ། །
en: “Devas, nāgas, asuras, kinnaras, Yakṣa lords, yakṣas, and mahoragas Rained down upon that throne A shower of divine coral tree flowers.

source: ཆོས་འདོད་ལྷ་ནི་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་། །བསམ་གྱིས་མི་ཁྱབ་གང་དག་ལྷགས་གྱུར་པ། །རིན་ཆེན་སོགས་པ་མངོན་པར་བྱུང་བ་ན། །ས་ལ་མེ་ཏོག་དག་གིས་མངོན་པར་འཐོར། །
en: “Countless thousands of quintillions of devas Who longed for the Dharma arrived, And they scattered sal flowers When Ratnoccaya was brought forth.

source: ཆོས་སྨྲ་རིན་ཆེན་སོགས་པ་དེ་ཉིད་ཀྱང་། །ཤིན་ཏུ་ལུས་བཀྲུས་གཙང་མའི་གོས་བགོས་ཏེ། །ཁྲི་དེར་ཉེ་བར་སོང་བ་བྱས་ནས་ནི། །ཐལ་མོ་སྦྱར་བ་བྱས་ཏེ་ཕྱག་ཀྱང་འཚལ། །
en: “The dharmabhāṇaka Ratnoccaya Washed his body and wore clean robes, And when he approached that throne With his palms together, he bowed to it.

source: ལྷ་དབང་དང་ནི་ལྷ་དང་ལྷ་མོ་རྣམས། །བར་སྣང་འདུག་ནས་མེ་ཏོག་མན་དཱ་རའི། །ཆར་པ་འབེབས་ཤིང་སིལ་སྙན་བརྒྱ་སྟོང་ཕྲག །བསམ་གྱིས་མི་ཁྱབ་པ་དག་རབ་ཏུ་སྒྲོགས། །
en: “The deva lords, the devas and devīs Residing in the sky, sent down a rain Of coral tree flowers and played Countless thousands of musical instruments.

source: རིན་ཆེན་སོགས་པ་དགེ་སློང་ཆོས་སྨྲ་དེས། །ཕྱོགས་བཅུ་དག་གི་སངས་རྒྱས་བྱེ་བ་སྟོང་། །བསམ་གྱིས་མི་ཁྱབ་པ་དག་དྲན་བྱས་ནས། །དེ་ནི་མངོན་པར་འཛེགས་ཏེ་འདུག་པར་གྱུར། །
en: “The dharmabhāṇaka bhikṣu Ratnoccaya, Remembering countless thousands of millions Of buddhas in the ten directions, Mounted the throne and sat upon it.

source: སེམས་ཅན་ཀུན་ལ་སྙིང་བརྩེ་བསྐྱེད་ནས་ནི། །སྙིང་རྗེའི་སེམས་ཀྱང་ཡང་དག་བསྐྱེད་བྱས་ཏེ། །རྒྱལ་པོ་ལེགས་པར་བྱུང་བ་དེ་ལ་ནི། །དེ་ཡི་ཚེ་ན་མདོ་སྡེ་འདི་བསྟན་ཏེ། །
en: “Thinking of all beings with kindness And developing a compassionate mind, At that time he taught this sūtra To that king, Susaṃbhava.

source: རྒྱལ་པོས་ཐལ་མོ་སྦྱར་བྱས་འདུག་ནས་སུ། །ཚིག་གཅིག་གིས་ནི་རྗེས་སུ་ཡི་རང་སྟེ། །
en: “The king bowed with palms together And rejoiced in each single word.

source: ཆོས་ཀྱི་ཤུགས་ཀྱིས་མིག་ནས་མཆི་མ་བྱུང་། །དེ་ཡི་ལུས་ནི་དགའ་བས་ཁྱབ་པར་གྱུར། །མདོ་སྡེ་འདི་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། །
en: Through the Dharma’s power he shed tears, And his body was permeated with joy.

source: དེ་ཚེ་རྒྱལ་པོ་ལེགས་པར་བྱུང་བ་ཡིས། །ཡིད་བཞིན་ནོར་བུ་རིན་ཆེན་རྒྱལ་པོ་བླངས། །སེམས་ཅན་རྣམས་ཕྱིར་སྨོན་ལམ་བཏབ་པ་ནི། །རིན་ཆེན་བདུན་དང་ལྡན་པའི་རྒྱན་རྣམས་དང་། །གང་ཡང་འཛམ་བུའི་གླིང་འདིར་སེམས་ཅན་རྣམས། །
en: “In order to make an offering to this sūtra, At that time King Susaṃbhava held up A king of precious wish-fulfilling jewels And made a prayer for the benefit of all beings: “ ‘May there rain down on this Jambudvīpa Jewelry that contain the seven jewels And whatever great wealth that will bring Happiness to the beings in this Jambudvīpa.’

source: བདེ་བར་གྱུར་པའི་ནོར་བུ་རིན་པོ་ཆེའི། །ཆར་པ་དེ་རིང་འཛམ་བུའི་གླིང་དུ་ཕོབ། །དེ་ཡི་ཚེ་ན་རིན་ཆེན་སྣ་བདུན་དང་། །དཔུང་རྒྱན་དང་ནི་དོ་ཤལ་རྣ་ཆ་མཆོག །དེ་བཞིན་ཟས་དང་གོས་དང་སྐོམ་རྣམས་ཀྱང་། །
en: “Just then a rain of the seven jewels, Of armlets, necklaces, and excellent earrings, And similarly, food, drink, and clothing, Rained down upon the four continents.

source: གླིང་བཞི་དག་ཏུ་རབ་ཏུ་བབ་པར་གྱུར། །རྒྱལ་པོ་ལེགས་པར་བྱུང་བས་འཛམ་གླིང་དུ། །རིན་ཆེན་ཆར་པ་འབབ་པ་དེ་མཐོང་ནས། །གླིང་བཞི་རིན་ཆེན་གང་བར་བཅས་པ་ནི། །རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་བསྟན་ལ་ཕུལ། །
en: “When King Susaṃbhava saw That precious rain fall on Jambudvīpa, He offered the four continents that were Filled with jewels to the teaching of Ratnaśikhin.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ང་། །རྒྱལ་པོ་ལེགས་པར་བྱུང་ཞེས་བྱ་བ་གྱུར། །གླིང་བཞི་དག་ནི་རིན་ཆེན་གང་བཅས་ཀྱི། །ས་འདི་དེ་ཚེ་ང་ཡིས་ཡོངས་སུ་བཏང་། །
en: “I, the Tathāgata Śākyamuni, was The king named Susaṃbhava, And at that time I offered up this earth With its four continents filled with jewels.

source: གང་གིས་རྒྱལ་པོ་ལེགས་པར་བྱུང་དེ་ལ། །དེ་ཚེ་མདོ་སྡེ་འདི་ནི་རབ་བསྟན་པ། །རིན་ཆེན་སོགས་པ་ཆོས་སྨྲ་དགེ་སློང་དེ། །དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་དེར་གྱུར་ཏོ། །ངས་གང་དེ་ཚེ་མདོ་སྡེ་འདི་ཐོས་ཤིང་། །ཚིག་གཅིག་གིས་ནི་རྗེས་སུ་ཡི་རངས་ཏེ། །ང་ནི་དགེ་བའི་ལས་ནི་དེ་ཉིད་དང་། །
en: “The dharmabhāṇaka bhikṣu Ratnoccaya, Who was the one at that time who taught This sūtra to King Susaṃbhava, Became the Tathāgata Akṣobhya.

source: ཆོས་ཉན་པ་དང་རྗེས་སུ་ཡི་རང་བས། །གསེར་གྱི་མདོག་དང་བསོད་ནམས་བརྒྱ་ཡི་མཚན། །བལྟ་ན་སྡུག་ཅིང་མིག་ཏུ་མངོན་མཛེས་ལ། །ལྷ་སྟོང་བྱེ་བ་རབ་ཏུ་དགའ་བྱེད་པ། །སྐྱེ་བོས་མཐོང་ན་དགའ་ལུས་རྟག་ཏུ་འཐོབ། །
en: “Because of the good karma from Listening at that time to this sūtra And rejoicing in each single word, Because of rejoicing and hearing the Dharma, “I always have a body that is golden in color, Has the signs of a hundred merits, Is beautiful to behold and a pleasure for the eyes, And when seen gladdens ten billion devas and gladdens beings.

source: བསྐལ་པ་དག་ནི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག །དགུ་བཅུ་རྩ་དགུར་འཁོར་ལོས་སྒྱུར་རྒྱལ་གྱུར། །བསྐལ་པ་བརྒྱ་སྟོང་དུ་མ་མང་པོར་ཡང་། །ངས་ནི་ཁམས་ཀྱི་རྒྱལ་པོ་མྱོང་བར་གྱུར། །
en: “For ninety-nine trillion eons I became a cakravartin king, And for many hundreds of thousands of eons I have experienced being the king of a realm.

source: བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་བརྒྱ་བྱིན་གྱུར། །ཚངས་པའི་དབང་པོ་ཡིད་བཞིན་དེ་བཞིན་ནོ། །གང་དག་ཚད་ནི་ནམ་ཡང་ཡོད་མིན་པའི། །སྟོབས་བཅུ་དཔག་མེད་ངས་ནི་མཉེས་པར་བྱས། །
en: “For countless eons I have been Śakras, and likewise I have been lords of Brahmās with peaceful minds, And I have pleased countless ones with the ten strengths, The number of which could never be known.

source: ངས་གང་མདོ་ཐོས་རྗེས་སུ་ཡི་རང་བ། །བསོད་ནམས་ཕུང་པོ་དེ་ལྟར་ཚད་མེད་མང་། །བསམ་པ་ཇི་བཞིན་ངས་ནི་བྱང་ཆུབ་ཐོབ། །ཆོས་སྐུ་དམ་པ་ཡང་ནི་ངས་ཐོབ་བོ། །
en: “Through the immeasurable accumulation of abundant merit From my hearing and rejoicing in this sūtra, I attained the enlightenment that I had aspired to, And I also attained the sublime Dharma body.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། ལེགས་པར་བྱུང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་གཅིག་པའོ།། །།དཔལ་ལྡན་ལྷ་མོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་གང་ལ་ལ་ཞིག་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མཆོད་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་ཤིང་རྒྱ་ཆེ་བ། བསམ་གྱིས་མི་ཁྱབ་པ་བྱེད་པར་འདོད་ཅིང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས།
en: This concludes “Susaṃbhava,” the twenty-first chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ཟབ་མོ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དེས། གཙུག་ལག་ཁང་ངམ། དགོན་པའི་ཕྱོགས་ཀྱང་རུང་སྟེ། གང་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའི་ས་ཕྱོགས་དེར། དེས་གདོན་མི་ཟ་བར་གཡེང་བ་མེད་པའི་སེམས་ཀྱིས་རྣ་བ་བླགས་ཏེ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པར་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་འཁོར་ལ་རྒྱ་ཆེར་བརྗོད་པའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །གང་ཞིག་སངས་རྒྱས་ཐམས་ཅད་ལ། །
en: Chapter 22: The Protection Given by Yakṣas “Great goddess Śrī, any noble man or noble woman who has faith and wishes to make an inconceivably, extremely vast and great offering of requisites to the past, future, and present buddha bhagavats, and wishes to know the profound field of activity of the past, future, and present buddhas, whether in a temple or in a wilderness, in whatever place The Lord King of Sūtras, the Sublime Golden Light is being correctly taught, in that place they should, with an undoubting and undistracted mind, pay attention and listen to this Lord King of Sūtras, the Sublime Golden Light.”

source: བསམ་ཡས་མཆོད་པ་བྱེད་འདོད་ཅིང་། །སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་བ། །ཟབ་མོ་རབ་ཏུ་ཤེས་འདོད་པས། །གཙུག་ལག་ཁང་ངམ་གནས་ཁང་ངམ། །གང་ན་གསེར་འོད་དམ་པ་ཡི། །མདོ་སྡེ་དམ་པ་འདི་སྟོན་པ། །ས་ཕྱོགས་དེར་ནི་འགྲོ་བར་བྱ། །
en: Then the Bhagavat, in order to describe this extensively to the assembly, recited these verses: “Someone who wishes to make an Inconceivable offering to all the buddhas, And wishes to know the profound Field of activity of all the buddhas, “Should go to the place, whether It is a temple or a dwelling, Where is taught this sūtra of The Sublime Golden Light.

source: མདོ་འདི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །ཡོན་ཏན་རྒྱ་མཚོ་མཐའ་ཡང་ཡས། །སྡུག་བསྔལ་རྒྱ་མཚོ་དུ་མ་ལས། །སེམས་ཅན་ཐམས་ཅད་ཐར་བར་བྱེད། །
en: “This sūtra is inconceivable; Its ocean of qualities is endless, And it liberates all beings From the oceans of many sufferings.

source: མདོ་སྡེ་ཡི་ནི་ཐོག་མ་དང་། །དབུས་དང་དེ་བཞིན་ཐ་མ་མཐོང་། །
en: “I see the beginning of this sūtra And also its middle and its conclusion.

source: མདོ་སྡེའི་དབང་པོ་རབ་ཟབ་སྟེ། །
en: This lord of sūtras is extremely profound.

source: འདི་ལ་དཔེ་ནི་ཡོད་མ་ཡིན། །
en: There is no analogy that exists for it.

source: གང་གཱ་དང་ནི་ས་རྣམས་དང་། །རྒྱ་མཚོ་དང་ནི་ནམ་མཁའ་ལ། །གནས་པའི་རྡུལ་ནི་གང་ཡང་རུང་། །དཔེར་བྱ་བར་ནི་མི་ནུས་སོ། །
en: “All of the particles that exist In the Ganges and on the earth, In the oceans and in the sky, Cannot serve as an analogy for it.

source: ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པ་ཡིས། །དེ་ཡི་ཚེ་ན་འཇུག་པར་བྱ། །ཆོས་ཀྱི་བདག་ཉིད་མཆོད་རྟེན་ནི། །
en: “The entrance to the Dharma realm Should be entered at that time.

source: ཟབ་མོར་རབ་བརྟན་གང་ཡིན་པ། །མཆོད་རྟེན་དེ་ཡི་དབུས་ན་ནི། །རྒྱལ་བ་ཤཱཀྱ་ཐུབ་པ་མཐོང་། །ཡིད་དུ་འོང་བའི་དབྱངས་ཀྱིས་སུ། །མདོ་སྡེ་འདི་ནི་རབ་ཏུ་སྟོན། །
en: Jina Śākyamuni should be seen In the center of a stūpa, “Which is the profound, enduring stūpa That is the embodiment of the Dharma, Teaching this sūtra perfectly With a voice that is beautiful.

source: གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་པའི། །བསྐལ་པ་བྱེ་བ་ཇི་སྙེད་པར། །ལྷ་ཡི་དང་ནི་མི་རྣམས་ཀྱི། །བདེ་བ་དག་ནི་རྗེས་སུ་མྱོང་། །
en: “May the happiness of devas And of humans be experienced For as many countless, innumerable Million of eons as there are.

source: གང་ཞིག་མདོ་སྡེ་འདི་ཉན་པ། །དེ་ལྟར་བདག་གི་བསོད་ནམས་ཀྱི། །ཕུང་པོ་བསམ་ཡས་བསྒྲུབ་སྙམ་དུ། །དེ་ཚེ་དེས་ནི་དེ་ལྟར་ཤེས། །
en: “Whoever listens to this sūtra Should think they will accomplish My inconceivable accumulation of merit; At that time, they should know this to be so.

source: མེས་གང་འོབས་ཀྱིས་བསྐོར་བ་ཡི། །དཔག་ཚད་བརྒྱ་དག་འདའ་བྱེད་ཅིང་། །ཚོར་བ་དྲག་པོ་བཟོད་བྱས་ནས། །མདོ་སྡེ་ཉན་པར་གང་ནུས་པ། །གཙུག་ལག་ཁང་ངམ་གནས་ཁང་དུ། །
en: “Someone should, in order to listen to this sūtra, Be able to endure the intense pain Of crossing over a hundred-yojana-wide Moat filled with a blazing inferno.

source: ཞུགས་ནས་དེ་མ་ཐག་ཏུ་ནི། །སྡིག་པ་རྣམས་ནི་མེད་པར་འགྱུར། །རྨི་ངན་མཚན་ཉིད་ཐམས་ཅད་དང་། །གཟའ་དང་རྒྱུ་སྐར་གནོད་པ་དང་། །བྱད་དང་གདོན་ནི་མི་བཟད་ཀྱང་། །
en: “Then, as soon as they enter into The temple or the dwelling, Their bad karma will be eliminated And all the qualities of nightmares, Harm from planets and lunar asterisms, And terrible evil spirits and demons Will be entirely driven away The moment that they enter there.
